package kr.or.bit;

/*
 * 책은 책 이름과 가격을 가지고 있다.
 * 책이 출판되면 반드시 책은 책의 이름과 가격을 가지고 있어야 한다. //메서드 생성
 * 책의 이름과 가격정보는 특정 기능을 통해서만 볼 수 있고, 출판 이후 수정할 수 없다. //(수정이란: 매개변수를 가지고 잇는것)
 * 책 이름과 가격 정보는 각각 정보를 읽을 수는 있다.  //(getter생성)
 */

/*
 * 시계는 제품명과 가격을 가지고 있다.
 * 시계가 출시되면 반드시 시계의 브랜드과 제품명을 가지고 있어야 한다. 시분초 입력, 제품번호가 만들어진다. 그걸 출력가능 //메서드 생성
 * 시계의 제품명과 가격은 특정 기능을 통해 정보만 볼 수 있고, 출시 이후 가격만 바꿀수 있다.  //(수정이란: 매개변수를 가지고 잇는것)
 * 시계의 시간을 볼수 있는 메서드 (오버로딩2개, 시분, 시분초)
 * 시계 제품명과 가격 정보는, 제품 번호 각각 정보를 읽을 수는 있다.  //(getter생성)
 */

/*
* 저희 회사는 1가지 제품만 생산하는 회사입니다.
* 생산하는 브랜드와 가격이 바뀌면 전 제품이 바뀝니다. 시계는 같은 브랜드와 가격을 가지고 있다
* 브랜드는 뻐꾸기, 가격은 15000원이다
* 시계는 만들어질 때 시침, 초침, 분침이 가리키는 시간을 지정해줘야 한다
* 시계는 만들어질 때마다 누적생산대수가 1대씩 늘어난다.
* (시:분:초)를 한번에 출력하는 기능을 가지고 있다.
* 시간은 새로 설정할 수 있고 (시, 분)을 설정하는 기능, (시,분,초)를 설정하는 기능이 같은 이름으로 동작해야 한다
* 시는 (0~12)만, 분은 (0~59)만, 초는 (0~59)만 가능하며 다른 값을 입력하면 0으로 설정된다.
*/

public class Book {
	private String name;
	private int price;
	
//	public void getName() {
//		System.out.println("책이름: "+name);
//	}
//
//	public void getPrice() {
//		System.out.println("책가격: "+price);
//	}
	
	public String getName() {
		return name;
	}
	
	public int getPrice() {
		return price;
	}

	public Book(String name, int price){
		this.name = name;
		this.price = price;
	}
	
	public void bookprint() {
		System.out.println("책이름: "+name+" ,가격: "+price);
	}
	
	
}
